# 문제: 문서검색 (백준 1543번)
# 한줄 풀이: 두 문자열을 받아서, 첫 문자열에서 인덱스만큼 뺀 길이가 길때까지 반복을 시키고, 
# 인덱스0번 부터 시작해서 두번째 문자열과 비교해서 같으면 두번째 문자열 길이만큼 인덱스를 증가시킴

# 세준이는 영어로만 이루어진 어떤 문서를 검색하는 함수를 만들려고 한다. 이 함수는 어떤 단어가 총 몇 번 등장하는지 세려고 한다. 그러나, 세준이의 함수는 중복되어 세는 것은 빼고 세야 한다. 예를 들어, 문서가 abababa이고, 그리고 찾으려는 단어가 ababa라면, 세준이의 이 함수는 이 단어를 0번부터 찾을 수 있고, 2번부터도 찾을 수 있다. 그러나 동시에 셀 수는 없다.

# 세준이는 문서와 검색하려는 단어가 주어졌을 때, 그 단어가 최대 몇 번 중복되지 않게 등장하는지 구하는 프로그램을 작성하시오.

# 입력
# 첫째 줄에 문서가 주어진다. 문서의 길이는 최대 2500이다. 둘째 줄에 검색하고 싶은 단어가 주어진다. 이 길이는 최대 50이다. 문서와 단어는 알파벳 소문자와 공백으로 이루어져 있다.

# 출력
# 첫째 줄에 중복되지 않게 최대 몇 번 등장하는지 출력한다.

# 예제 입력 1 
# ababababa
# aba
# 예제 출력 1 
# 2
# 예제 입력 2 
# a a a a a
# a a
# 예제 출력 2 
# 2

document = input()
word = input()

index = 0 
result = 0

# word의 길이보다 doc의 길이가 클때까지 , 단 doc길이는 index만큼 빼주고 인덱스는 값을 찾았다면 word만큼, 못찾았다면 1씩 증가시킨다
while len(document) - index >= len(word):
    if document[index:index+len(word)] == word:
        result += 1
        index += len(word)
    else:
        index += 1

print(result)
